{"pageProps":{"postData":{"id":"eal","contentHtml":"<p>Elementary Affine Logic (EAL) is a type system designed to guarantee that programs terminate in elementary time—a complexity class bounded by finite towers of exponentials, such as \n<code>2^(2^n)</code>\n. This makes EAL a powerful framework for reasoning about computational efficiency in a rigorous way. For this article, we&#39;ll focus on propositional EAL without quantification, keeping our exploration accessible while diving into its core concepts and implementation. It is important to note that the implementation is not focusing on performance and not performing type inference, only basic type checking.</p>\n<p>EAL is built upon affine logic, a substructural logic that modifies traditional proof theory by rejecting the contraction rule, which prevents assumptions from being reused multiple times, while embracing weakening, allowing unused variables to remain in the context. This contrasts with linear logic, where variables must be used exactly once; affine logic relaxes this to &quot;at most once,&quot; providing flexibility to ignore resources if they are not needed. In the context of programming, particularly within lambda calculus, this translates to a system where function arguments are used at most once, with some potentially left unused. EAL extends this foundation to target terms that align with the computational power of elementary bounded Turing machines. It also connects to Lamping&#39;s optimal reduction algorithm, which minimizes the number of beta-reduction steps, ensuring efficient normalization of terms.</p>\n<h3>Core Characteristics of EAL</h3>\n<p>EAL is specifically crafted to type terms that can be reduced in elementary time, leveraging affine logic&#39;s resource-sensitive nature. Variables cannot be reused unless explicitly marked with the bang modality (!A), which allows controlled reuse, while unused assumptions are permitted, aligning with the weakening rule. The bang modality (!A) is central to EAL, selectively relaxing the &quot;at most once&quot; rule to balance efficiency and flexibility. However, this imposes restrictions, preventing constructs like extensive variable sharing or polymorphism from being typed within the system—a necessary trade-off for EAL&#39;s performance guarantees.</p>\n<h3>Implementing EAL</h3>\n<p>Now let&#39;s gets get to work and write a simple implementation of EAL in Haskell.\nThis implementation focuses on the concept and the simple typing rules, not in\nperformance neither the type inference (that is more complex).</p>\n<p>The first step is to define the types and terms that constitute the EAL system:</p>\n<pre><code class=\"language-haskell\">-- Type definitions\ndata Type\n  = TVar String          -- Type variable, e.g., &quot;a&quot;\n  | Bang Type            -- !A, for reusable terms\n  | Type :-&gt; Type        -- Function type, A -&gt; B\n  deriving (Show, Eq)\n\n-- Term definitions\ndata Term\n  = Var String           -- Variable, e.g., &quot;x&quot;\n  | App Term Term        -- Application, M N\n  | Lam String Type Term -- Lambda abstraction, \\x:A.M\n  | Box Term             -- Boxing for !A\n  deriving (Show, Eq)\n</code></pre>\n<p>These definitions capture the essence of EAL. For types, <code>TVar String</code> represents type variables. Bang Type introduces the <code>!A</code> modality, marking a type as reusable, which is crucial for EAL&#39;s promotion rule. <code>Type :-&gt; Type</code> defines function types (e.g., <code>A -&gt; B</code>), mirroring the arrow type in lambda calculus. For terms, <code>Var String</code> represents variables (e.g., &quot;x&quot;) associated with types in the context. <code>App Term</code> Term corresponds to applying one term to another (e.g., <code>M N</code>). <code>Lam String Type Term</code> represents lambda abstraction (e.g., <code>λx:A.M</code>), binding a variable to its type for function definitions. Finally, <code>Box Term</code> wraps a term to assign it the type <code>!A</code>, enabling controlled reuse through the bang modality.</p>\n<p>Now, we need to define the context and how do we interact with it.\nWe need to track down variable usages. Note that this could be done only via typing, i.e we could enforce the affine property in the type of the context instead of naively implementing it in the functions. The way is done here, if a context is already broken on creation, an error will not pop. But since this is a toy implementation, im ok with that.</p>\n<pre><code class=\"language-haskell\">type Ann = (String, Type)  -- Annotated variable, e.g., (&quot;x&quot;, TVar &quot;a&quot;)\ntype Ctx = [Ann]           -- Context as a list of annotations\ntype UsedVars = [String]   -- List of variables used so far\n\n-- Extend context with a new variable\nextend :: Ctx -&gt; Ann -&gt; Either String Ctx\nextend ctx ann@(var, typ) =\n  case lookup var ctx of\n    Just _  -&gt; Left (&quot;Variable &quot; ++ var ++ &quot; used more than once.&quot;)\n    Nothing -&gt; Right (ann : ctx)\n\n-- Filter out used variables, keeping banged ones\nfilterUsed :: Ctx -&gt; [String] -&gt; Ctx\nfilterUsed ctx used = filter (\\(s, t) -&gt; s `notElem` used || case t of Bang _ -&gt; True; _ -&gt; False) ctx\n\n-- Check if all variables are banged\nallBanged :: Ctx -&gt; Bool\nallBanged ctx = all (\\(_, t) -&gt; case t of Bang _ -&gt; True; _ -&gt; False) ctx\n</code></pre>\n<p>Here, <code>Ann</code> and <code>Ctx</code> define the structure of the typing context, pairing variables with their types. <code>UsedVars</code> tracks consumed variables, ensuring non-banged variables are not reused. The extend function adds a new variable to the context but fails if the variable is already present, reflecting EAL&#39;s no-contraction rule. <code>filterUsed</code> updates the context after a variable is used: non-banged variables are removed once consumed, while banged variables (!A) remain available, aligning with the dereliction and contraction rules. <code>allBanged</code> checks if every variable in the context has a banged type, a prerequisite for the promotion rule used in the Box construct. These mechanisms ensure the context accurately reflects variable availability, respecting affine constraints and the exceptions granted by the bang modality.</p>\n<p>Now let&#39;s do some type checking!</p>\n<p>The core of the implementation lies in the typeCheck function, which enforces EAL&#39;s typing rules across four patterns: variables, application, lambda abstraction, and boxing:</p>\n<pre><code class=\"language-haskell\">typeCheck :: Ctx -&gt; Term -&gt; Either String (Type, UsedVars)\n-- Variable case\ntypeCheck ctx (Var x) =\n  case lookup x ctx of\n    Just (Bang t) -&gt; Right (t, [])       -- Banged variable, reusable\n    Just t        -&gt; Right (t, [x])      -- Non-banged, used once\n    Nothing       -&gt; Left $ &quot;Variable &quot; ++ x ++ &quot; not found in context&quot;\n\n-- Application case\ntypeCheck ctx (App m n) = do\n  (typM, varsM) &lt;- typeCheck ctx m\n  case typM of\n    a :-&gt; b -&gt; do\n      let newCtx = filterUsed ctx varsM\n      (typN, varsN) &lt;- typeCheck newCtx n\n      if typN == a\n        then Right (b, varsM ++ varsN)\n        else Left (&quot;Type Mismatch. Expected: &quot; ++ show typN ++ &quot; to be of type &quot; ++ show a)\n    _ -&gt; Left &quot;Application requires a function type&quot;\n\n-- Lambda case\ntypeCheck ctx (Lam bound typ bod) = do\n  newCtx &lt;- extend ctx (bound, typ)\n  (typBod, varsBod) &lt;- typeCheck newCtx bod\n  let lamTyp = typ :-&gt; typBod\n  let freeVars = filter (/= bound) varsBod\n  Right (lamTyp, freeVars)\n\n-- Box case\ntypeCheck ctx (Box t) = do\n  if allBanged ctx\n    then do\n      (typT, varsT) &lt;- typeCheck ctx t\n      Right (Bang typT, varsT)\n    else Left &quot;Promotion requires a context of only banged types&quot;\n</code></pre>\n<p>Each case corresponds to a specific typing rule in EAL, which we&#39;ll now examine using standard type theory notation.</p>\n<p>Variable (Var x)</p>\n<pre><code> x : A ∈ Γ \n------------ (if A is not banged)\n Γ ⊢ x : A\n\n\n x : !A ∈ Γ\n------------ (dereliction for banged variables)\n Γ ⊢ x : A\n</code></pre>\n<p>For a variable x, the type checker looks it up in the context. If x has a banged type (!A), it can be used as A without being consumed, thanks to the dereliction rule, so it&#39;s not added to the list of used variables. If x has a non-banged type (A), it&#39;s used once and marked as consumed. This enforces EAL&#39;s no-contraction rule while allowing banged variables to persist.</p>\n<p>Application (App m n)</p>\n<pre><code> Γ ⊢ M : A → B   Δ ⊢ N : A\n--------------------------\n  Γ,Δ ⊢ M N : B\n</code></pre>\n<p>To type M N, the type checker first types M in the current context to obtain its type, which must be a function A -&gt; B. It then filters the context to remove any non-banged variables used in M, ensuring they aren&#39;t reused illicitly. Next, it types N in this updated context to check if its type matches A. If so, the application is typed as B, and the used variables from both M and N are combined.</p>\n<p>Lambda (Lam bound typ bod)</p>\n<pre><code>   Γ, x : A ⊢ M : B\n-----------------------\n  Γ ⊢ λx : A.M : A → B\n</code></pre>\n<p>Typing Rule:</p>\n<p>For a lambda abstraction \\x:A.M, the type checker extends the context with x : A, ensuring x is fresh per the no-contraction rule. It then types the body M in this extended context to determine its type B. The overall type of the lambda is A -&gt; B, and any variables used in the body (except x) are tracked for future checks.</p>\n<p>Box (Box t) - Promotion</p>\n<pre><code>  Γ ⊢ M : A where Γ = x1 : !A1, ..., xn : !An\n-----------------------------------------------\n                  Γ ⊢ !M : !A\n</code></pre>\n<p>The Box construct implements the promotion rule, allowing a term M to be &quot;boxed&quot; into !A if it can be typed in a context where all variables are banged, checked using allBanged. If the condition holds, the type checker types M in the current context and wraps its type in Bang, enabling reuse. If the context contains non-banged variables, the promotion fails, enforcing EAL&#39;s strict conditions for reuse.</p>\n<p>EAL&#39;s power lies in guaranteeing that any term it types will normalize in elementary time, often achieved through reduction strategies like Lamping&#39;s algorithm, which optimizes the reduction process by minimizing redundant steps. The combination of strict variable usage and controlled reuse via the bang modality ensures that reduction complexity is bounded predictably. However, this comes at the cost of some expressiveness.</p>\n<h2>References and Further Reading</h2>\n<p><a href=\"https://doi.org/10.1007/11417170_6\">Baillot, P., Terui, K. (2005). A Feasible Algorithm for Typing in Elementary Affine Logic. In: Urzyczyn, P. (eds) Typed Lambda Calculi and Applications. TLCA 2005. Lecture Notes in Computer Science, vol 3461. Springer, Berlin, Heidelberg.</a></p>\n<p><a href=\"https://doi.org/10.1007/11417170_11\">Coppola, P., Dal Lago, U., Della Rocca, S.R. (2005). Elementary Affine Logic and the Call-by-Value Lambda Calculus. In: Urzyczyn, P. (eds) Typed Lambda Calculi and Applications. TLCA 2005. Lecture Notes in Computer Science, vol 3461. Springer, Berlin, Heidelberg.</a></p>\n<p><a href=\"https://www.academia.edu/73045075/Principal_Typing_for_Lambda_Calculus_in_Elementary_Affine_Logic\">Coppola, Paolo. “Principal Typing for Lambda Calculus in Elementary Affine Logic.” Fundamenta Informaticae (2005): n. pag. Print.</a></p>\n<p><a href=\"https://arxiv.org/abs/1805.07518\">Affine logic for constructive mathematics</a></p>\n","title":"Elementary Affine Logic","description":"Understanding EAL and typechecking it","date":"2025-02-22"}},"__N_SSG":true}