{"pageProps":{"postData":{"id":"superpositions","contentHtml":"<p>I have been working on a symbolic regression algorithm implementation on HVM. Let&#39;s start out with a motivation. Why try to reimplement symbolic regression, and what is this to begin with?</p>\n<h2>Symbolic Regression</h2>\n<p>As the name states it is a regression analysis, and in this particular case we want to find the best fit for a dataset. For example, consider the following data:\n<code>x = [1, 2, 3, 4, 5] y = [2, 4, 6, 8, 10]</code></p>\n<p>It is reasonable to say that the equation that &quot;commands&quot; this dataset is <code>y = 2x</code>. But how did you conclude this? You found a pattern between the y set and the x set. There are many ways of doing this in math, and symbolic regression is one of them.</p>\n<p>What is different in this approach is that we are searching the space of mathematical expressions to find the model that best fits our data, both in terms of accuracy and simplicity. </p>\n<p>To search things, we have to define a &quot;grammar&quot;, a set of symbols that define our equations. For example, suppose in our universe, we only have the opeartion of addition and we also have only the constants 1 and 2. How many equations can we enumerate?</p>\n<p>Well, there are 6 of them:</p>\n<ul>\n<li><code>y = 1</code></li>\n<li><code>y = 2</code> </li>\n<li><code>y = 1 + 1</code></li>\n<li><code>y = 1 + 2</code></li>\n<li><code>y = 2 + 1</code></li>\n<li><code>y = 2 + 2</code></li>\n</ul>\n<p>As you may imagine, if in a set with one operator and two constants we have 6 equations, and considering that the set of real numbers is infinite, the set of possible equations is also infinite right? So how to tackle this? Well, a good idea is to shrink this problem and solve a smaller instance first. So let&#39;s try the naive approach using a small set of symbols and constants.</p>\n<p>Consider only the operators addition (+) and product (*), and the constants 1, 2, 3 and 4. And for now, we&#39;re using Haskell instead of HVM.</p>\n<p>When doing this, my first thought was: how to model the equation? The most obvious answer (for me) was that the equation is a like an AST (abstract syntax tree). So let&#39;s model it like this:</p>\n<ul>\n<li>A tree is formed by either a leaf (that holds a constant), or a leaf that is a variable, or a node which contains the operator (we&#39;re using a string for now) and two other children nodes (considering that our operators are binary for now).</li>\n</ul>\n<p>In haskell:</p>\n<pre><code class=\"language-hs\">data Tree = Leaf Int | Var | Node String Tree Tree deriving (Show, Eq)\n</code></pre>\n<p>And my second thought was on how to enumerate every possibility of a tree given a depth. Turns out that the code is very simple, we simply map the 0 level as being the constants + a variable and the other levels being a combination of every operator with its down level. It looks like this:</p>\n<pre><code>enumerateTrees :: Int -&gt; [Tree]\nenumerateTrees maxDepth = concatMap generateTrees [0..maxDepth]\n  where\n    generateTrees :: Int -&gt; [Tree]\n    generateTrees 0 = map Leaf constants ++ [Var]\n    generateTrees depth =\n        [Node op left right |\n         op &lt;- operators,\n         left &lt;- generateTrees (depth - 1),\n         right &lt;- generateTrees (depth - 1)]\n</code></pre>\n<p>We also need a way to evaluate a certain tree, otherwise we can&#39;t check either our equation is correct or not. We also need a way to measure how far (or close) are we from the correct equation. </p>\n<p>To do the evaluation, we simply need to translate our op strings to real operations and recursively eval the tree (where we receive a value for x, the variable).</p>\n<pre><code>evaluateTree :: Tree -&gt; Int -&gt; Int\nevaluateTree (Leaf n) _ = n\nevaluateTree Var x = x\nevaluateTree (Node op left right) x =\n    case op of\n        &quot;+&quot; -&gt; leftVal + rightVal\n        &quot;*&quot; -&gt; leftVal * rightVal\n        _ -&gt; 0\n    where\n        leftVal = evaluateTree left x\n        rightVal = evaluateTree right x\n</code></pre>\n<p>For the fitness part, we will be using Mean Squared Error, which is basically the distance from our prediction to the correct prediction, but squared (to avoid negative values).</p>\n<pre><code>fitness :: Tree -&gt; Data -&gt; Float\nfitness tree data&#39; =\n    let mse = sum [(fromIntegral (evaluateTree tree x) - fromIntegral y) ^ 2 | (x, y) &lt;- data&#39;]\n    in mse / fromIntegral (length data&#39;)\n</code></pre>\n<p>Note that the <code>Data</code> type is simply a list of tuples <code>(x, y)</code>. So now, we want to minimize the MSE to find the best fit to the equation given by the dataset. The correct equation would have <code>MSE = 0</code>, since the distance from the predicted points and the actual points is zero.</p>\n<p>Now, we need to actually run the symbolic regression, by finding the lowest fit. We basically loop through all enumerated trees up to a given depth and get the best one:</p>\n<pre><code class=\"language-hs\">symbolicRegression :: Data -&gt; Int -&gt; Int -&gt; Tree\nsymbolicRegression data&#39; maxDepth maxTrees =\n    let trees = take maxTrees $ enumerateTrees maxDepth\n        bestTree = minimumBy (comparing (\\t -&gt; fitness t data&#39;)) trees\n    in bestTree\n</code></pre>\n<p>And that&#39;s it, we now have a working symbolic regression algorithm that will search the mathematical space to find the equation that best models the dataset. It is easy to extend this with more operators, constants and so on.</p>\n<p>But this is not quite performant right? Indeed, if you try to add a lot of constants or model a very complex equation that demands a tree with a high depth, it will take a lot of time (and maybe it won&#39;t find the exact fit nor a good one).</p>\n<p>There are a lot of improvements and research in this kind of algorithm, as recombining equations using genetic programming, utilizing Bayesian methods and neural networks and so on. But before complicating this, let&#39;s discuss what&#39;s the role of HVM in this context.</p>\n<h2>HVM</h2>\n<p>HVM is a parallel runtime, a compiler and evaluator for high-level languages that implements optimal reduction through the concurrent computation model of Interaction Combinators.</p>\n<p>Diving deep into theory, you&#39;ll reach some topics such as optimal reduction of lambda calculus, how to share computations, orders of evaluation and so on. But this is a little bit more complex than it looks, so I&#39;ll discuss it in another article. The point is that HVM achieves optimal evaluation.</p>\n<p>In addition to this, in HVM there is the concept of <em>superposition</em>, that is the main reason of why we&#39;re going to write symbolic regression on HVM. Let&#39;s understand it through a simple example.</p>\n<p>Suppose you want to factorize prime numbers in the most obvious way possible. We are just going to loop and test each factor untill we find a combination that results in the number we want. And let&#39;s do this in binary. (The code from this example was written by @VictorTaelin and its reference is in the end of the article).</p>\n<p>First of all, we define the type of a bitstring:</p>\n<p><code>data Bin { #O{pred} #I{pred} #E }</code></p>\n<p>Which is a very common recursive data type. For example, <code>#O{#I{#E}}</code> is a valid bitstring that represents <code>O1</code>. Now, if <code>P</code> is the number we want to factorize we can define this factorization as: there are two numbers <code>x</code> and <code>y</code> that when multiplied result in <code>P</code>, where <code>x</code> and <code>y</code> are the factors. Therefore, <code>x * y = P</code>. So, we need to define multiplication, equality and other helper functions that are needed (increment, add, concat).</p>\n<p>I will skip these implementations because they are not different from other functional languages. We will focus on the superposition concept and enumerating binary strings. So assume now we have all the operations we need. Now, the next step in other languages would be to loop through the numbers and check if their multiplication match. But here we will follow a different path.</p>\n<p>We want to enumerate all possible bitstrings up to a given length. So for example, if we choose length 2, we have:</p>\n<ul>\n<li><code>01</code></li>\n<li><code>00</code></li>\n<li><code>11</code></li>\n<li><code>10</code>\n(ignoring the #end constructor)</li>\n</ul>\n<p>We always have <code>2^n</code> possibilities where <code>n</code> is the length given. The code to do this looks like:</p>\n<pre><code>// Enums all Bins of given size (label 1)\n@all1(s) = ~s{\n  0: #E\n  p: !&amp;1{p0 p1}=p &amp;1{ #O{@all1(p0)} #I{@all1(p1)} }\n}\n</code></pre>\n<p>You may not be familliar with the syntax, but it&#39;s nothing too fancy. <code>@</code> defines a function called all1 that receives an argument <code>s</code> (the size of the bitstring. <code>~s</code> is a <code>match</code> on the size, which is a native number.</p>\n<p>If <code>s</code> is zero, we reached the end of the bitstring, so simply return the end constructor. Otherwise, we:</p>\n<ul>\n<li>Duplicate p</li>\n<li>Create a superposition where one side branches to <code>#O</code> and the other branches to <code>#I</code>.</li>\n</ul>\n<p>We have to duplicate <code>p</code> because HVM is linear, which mean we can only use a variable once. <code>!&amp;label{}</code> is just the syntax for duplicating. The label is important, but we&#39;re going to discuss it more later.</p>\n<p>Now we create the superposition of all bitstrings. Let&#39;s take a look at the output of calling <code>@all1(2)</code> when running the file with <code>hvml run enum_primes.hvml</code>:</p>\n<p><code>&amp;1{#0{&amp;1{#0{#2{}} #1{#2{}}}} #1{&amp;1{#0{#2{}} #1{#2{}}}}}</code></p>\n<p>This is not very readable, but everytime you see a <code>&amp;</code> we are branching into a superposition. <code>#0 #1 and #2</code> are just the format HVM uses to the constructors, so <code>#O</code> is <code>#0</code>, <code>#I</code> is <code>#1</code> and so on. </p>\n<p>Fortunately, we have a way to <em>collapse</em> the superpositions and see the all the bitstrings generated individually. The collapse algorithm is also very interesting, and a topic to another article.</p>\n<pre><code>#0{#0{#2{}}}\n#0{#1{#2{}}}\n#1{#0{#2{}}}\n#1{#1{#2{}}}\n</code></pre>\n<p>If you look closer, you&#39;ll see these 4 bitstrings are the ones i enumerated earlier. Cool right? So, basically what we are doing when opening an <code>&amp;{}</code> block is opening a superposition of two values (that can be composite as you can see), which means we are branching in two values. One universe goes to the <code>I</code> branch, and the other one goes to the <code>O</code> branch. But why is this so useful? Well, it is useful because this superposed values <em>share computation</em>. So for example, if we have this operation:\n<code>(+ (* 2 3) &amp;{2 3})</code></p>\n<p>The result when running with collapse mode is both 8 and 9, and they shared the <code>(* 2 3)</code> computation.</p>\n<p>Another interesting property in the case of our binary data structure is the lazy abortion of useless universes. What does this mean? Well, I&#39;m going to use a similar example from <a href=\"https://gist.github.com/VictorTaelin/93c327e5b4e752b744d7798687977f8a\">this article</a>, also from Victor Taelin.</p>\n<p>Suppose we want to solve the following equation:</p>\n<p><code>x + 1 == 3</code> or in binary, <code>x + 0b001 == 0b101</code></p>\n<p>Typically, we will decrement 1 from both sides of the equation and find the predecessor of 0b101. With superpositions, we do it like (simplified syntax):</p>\n<pre><code>x = {E {(O X) (I X)}}\ny = (I ( O ( I E)))\n\n// solving x + 1 == y\nmain = \n  let goal = (equal (add x (I E)) Y)\n  (Collapse (if goal { X } else { * }))\n</code></pre>\n<p>This will kind of &quot;fork&quot; the HVM runtime into infinite universes, one for each value of <code>x</code>, and return the first one that satifies that equation. Then, in that &quot;universe&quot;, we print the value of <code>x</code>. In any other runtime, doing this would be exponential on the length <code>n</code> of the bitstring, as there are <code>2^n</code> bitstrings to consider, as stated before. However, this works and it is quadratic, because of the lazy abortion. An immense amount of shared work across all of those universes, and optimal lazy evaluation quickly aborts any universe where the equation isnt satisfied.</p>\n<p>Reference: <a href=\"https://gist.github.com/VictorTaelin/9061306220929f04e7e6980f23ade615\">https://gist.github.com/VictorTaelin/9061306220929f04e7e6980f23ade615</a></p>\n<p>Now that we understand the concept of superposition, let&#39;s continue with the symbolic regression example. Let&#39;s model the same tree data type.</p>\n<pre><code>data Tree {\n  #Leaf{val}\n  #Var{}\n  #Node{op lft rgt}\n}\n</code></pre>\n<p>Pretty much the same as the haskell implementation. I&#39;ll let some other constructors we will use below:</p>\n<pre><code>data Pair {\n  #Pair{fst snd}\n}\n\ndata List {\n  #Nil\n  #Cons{head tail}\n}\n\ndata Operators {\n  #Plus\n  #Mul\n  #Min\n  #Max\n  #Mod\n}\n</code></pre>\n<p>Since the enumeration part is the funniest part, i&#39;ll let it to the end. Let&#39;s define evaluation of a tree and fit first:</p>\n<pre><code>@eval_tree(tree x) = ~tree !x {\n  #Leaf{val}: val\n  #Var: x\n  #Node{op lft rgt}: \n    !&amp;0{x0 x1}=x\n    !lftval = @eval_tree(lft x0)\n    !rgtval = @eval_tree(rgt x1)\n    ~op !lftval !rgtval {\n      #Plus: (+ lftval rgtval) \n      #Mul: (* lftval rgtval)\n      #Min: @min(lftval rgtval)\n      #Max: @max(lftval rgtval)\n      #Mod: (% lftval rgtval)\n    } \n}\n</code></pre>\n<p>The syntax may look scary, but it is not that complicated. We are simply matching the tree constructors (and the !x syntax allows us to use x in every branch). If it is a leaf, the evaluation is simply the leaf value. If a var, the var value. If it is a node, we apply the node operation with the recursed evaluated left and right sides of the node.</p>\n<pre><code>@mse(tree data acc acclen) = ~data !acc !tree !acclen {\n  #Nil: #Pair{acc acclen}\n  #Cons{h t}: \n    ~h {\n      #Pair{x y}: \n        !&amp;4{t1 t2}=tree\n        !pred_y  = @eval_tree(t1  x)\n        !mse_val = (- pred_y y)\n        !&amp;5{msev0 msev1}=mse_val\n        !mse_sqrd = (* msev0 msev1)\n        @mse(t2 t (+ acc mse_sqrd) (+ acclen 1)) \n    }\n}\n\n// where data is a list of pairs x, y that is the generated dataset\n@fit(tree data) =\n  !mselen = @mse(tree data 0 0)\n  ~mselen {\n    #Pair{mse len}: (/ mse len)\n  }\n</code></pre>\n<p>For the fit implementation, we need the mse calculation. We&#39;re basically predicting y, calculating the metric and returning a pair with the mse and the length of the tree. The <code>!&amp;{}</code> syntax is explicit duplication, as used before.</p>\n<p>And that&#39;s it for our measures and evaluation. Now we need to enumerate all the trees and finally run symbolic regression.</p>\n<p>First of all, let&#39;s enumerate all operators possible:</p>\n<p><code>@all_oper(&amp;L) = @SUP(&amp;L #Plus @SUP(&amp;L #Mul @SUP(&amp;L #Min @SUP(&amp;L #Max #Mod))))</code></p>\n<p>Wait, but why are we using this different syntax for superpositions now? Well, if you take a closer look, we are receiving an argument. This argument is a label. This <code>@SUP</code> native function receives a label and the two things we want to superpose. It is the same as using the <code>&amp;{}</code> syntax, but now we can pass a label that we receive as an argument (and cloning it without having to manually do it for every call). The reason we need the same label is because we need the right and left branches of our tree to have different labels, otherwise we will not enumerate as many trees as we want.</p>\n<p>An explanation to that comes from the <a href=\"https://discord.com/channels/912426566838013994/915345481675186197/1311434500911403109\">Higher Order Co discord</a>. Therefore, we need to use dynamic sups and fork the labels (doing some label arithmetic). We will see this in work in the tree enumerator.</p>\n<p>Let&#39;s also enumerate some constants possibilities:</p>\n<pre><code>@consts = [#Var #Leaf{4} #Leaf{5}]\n\n@all_consts(&amp;L c_list) = ~c_list {\n  #Nil: *\n  #Cons{h t}: @SUP(&amp;L h @all_consts(&amp;L t))\n}\n</code></pre>\n<p>Here we are doing basically the same thing as in the operators superposition.</p>\n<p>Now we have all set to enumerate the tree:</p>\n<pre><code>@all(s l) = ~s !l {\n  0:\n    @all_consts(l @consts)\n  p:\n    !&amp;0{p p0}=p\n    !&amp;0{p p1}=p\n    !&amp;0{p p2}=p\n    !&amp;0{p p3}=p\n\n    !&amp;0{l l0}=l\n    !&amp;0{l l1}=l\n    !&amp;0{l l2}=l\n    !&amp;0{l l3}=l\n    !&amp;0{l l4}=l\n    !&amp;0{l l5}=l\n    !&amp;0{l l6}=l\n\n    ! lL = (+ (* l0 2) 0)\n    ! lR = (+ (* l1 2) 1)\n    \n    !all_oper = @all_oper(l6)\n\n    @SUP(l2 #Node{all_oper @all(p1 (+ (* l3 2) 0)) @all(p2 (+ (* l4 2) 1))} @all_consts(l5 @consts))\n}\n</code></pre>\n<p>We are enumerating all trees up to a given depth. When depth is zero, we are in the &quot;leaf level&quot;. So, we basically can have all constants in that level. Then, in the recursive level, we clone p a bunch of times (because we need to use it to the recursive calls). Then we clone <code>l</code>, which is the label for the current branch (because we use it to calculate the next labels and to label the current level&#39;s and branch constants and operators. Then, <code>lL</code> and <code>lR</code> are the new left and right branches for the next level. Then, we create a big superposition with all the possible operators, recursively call tree enumeration with the new left label, same for the right side, and also all the constants since the right and left side of a node can be a var or constants.</p>\n<p>And now we have all the possible trees! Let&#39;s run a simple example with <code>depth=1</code> and collapse:</p>\n<pre><code>&quot;#Var{}&quot;\n&quot;#Leaf{4}&quot;\n&quot;#Node{#Plus #Var{} #Var{}}&quot;\n&quot;#Leaf{5}&quot;\n&quot;#Node{#Plus #Var{} #Leaf{4}}&quot;\n&quot;#Node{#Plus #Leaf{4} #Var{}}&quot;\n&quot;#Node{#Mul #Var{} #Var{}}&quot;\n&quot;#Node{#Plus #Var{} #Leaf{5}}&quot;\n&quot;#Node{#Plus #Leaf{4} #Leaf{4}}&quot;\n&quot;#Node{#Plus #Leaf{5} #Var{}}&quot;\n&quot;#Node{#Mul #Var{} #Leaf{4}}&quot;\n&quot;#Node{#Mul #Leaf{4} #Var{}}&quot;\n&quot;#Node{#Min #Var{} #Var{}}&quot;\n&quot;#Node{#Plus #Leaf{4} #Leaf{5}}&quot;\n&quot;#Node{#Plus #Leaf{5} #Leaf{4}}&quot;\n&quot;#Node{#Mul #Var{} #Leaf{5}}&quot;\n&quot;#Node{#Mul #Leaf{4} #Leaf{4}}&quot;\n&quot;#Node{#Mul #Leaf{5} #Var{}}&quot;\n&quot;#Node{#Min #Var{} #Leaf{4}}&quot;\n&quot;#Node{#Min #Leaf{4} #Var{}}&quot;\n&quot;#Node{#Max #Var{} #Var{}}&quot;\n&quot;#Node{#Mod #Var{} #Var{}}&quot;\n&quot;#Node{#Plus #Leaf{5} #Leaf{5}}&quot;\n&quot;#Node{#Mul #Leaf{4} #Leaf{5}}&quot;\n&quot;#Node{#Mul #Leaf{5} #Leaf{4}}&quot;\n&quot;#Node{#Min #Var{} #Leaf{5}}&quot;\n&quot;#Node{#Min #Leaf{4} #Leaf{4}}&quot;\n&quot;#Node{#Min #Leaf{5} #Var{}}&quot;\n&quot;#Node{#Max #Var{} #Leaf{4}}&quot;\n&quot;#Node{#Max #Leaf{4} #Var{}}&quot;\n&quot;#Node{#Mod #Var{} #Leaf{4}}&quot;\n&quot;#Node{#Mod #Leaf{4} #Var{}}&quot;\n&quot;#Node{#Mul #Leaf{5} #Leaf{5}}&quot;\n&quot;#Node{#Min #Leaf{4} #Leaf{5}}&quot;\n&quot;#Node{#Min #Leaf{5} #Leaf{4}}&quot;\n&quot;#Node{#Max #Var{} #Leaf{5}}&quot;\n&quot;#Node{#Max #Leaf{4} #Leaf{4}}&quot;\n&quot;#Node{#Max #Leaf{5} #Var{}}&quot;\n&quot;#Node{#Mod #Var{} #Leaf{5}}&quot;\n&quot;#Node{#Mod #Leaf{4} #Leaf{4}}&quot;\n&quot;#Node{#Mod #Leaf{5} #Var{}}&quot;\n&quot;#Node{#Min #Leaf{5} #Leaf{5}}&quot;\n&quot;#Node{#Max #Leaf{4} #Leaf{5}}&quot;\n&quot;#Node{#Max #Leaf{5} #Leaf{4}}&quot;\n&quot;#Node{#Mod #Leaf{4} #Leaf{5}}&quot;\n&quot;#Node{#Mod #Leaf{5} #Leaf{4}}&quot;\n&quot;#Node{#Max #Leaf{5} #Leaf{5}}&quot;\n&quot;#Node{#Mod #Leaf{5} #Leaf{5}}&quot;\n</code></pre>\n<p>I double checked that we have all the possibilities. The tree with depth 2 is very big, but if you wanna see it, give it a try. The gist with the complete code will be in the end of this article.</p>\n<p>Now, we just need to tell hvm to collapse and print the result if the measure of fit is equal 0 (we are looking for exact matches). And this is simpler than it is in haskell:</p>\n<pre><code>@X = @all(1 1)\n\n@main =   \n  !data = @data(10 #Nil 1)\n  @if( (== @fit(@X data) 0) @do_show_tree(@X) *)\n</code></pre>\n<p>Simple, huh? We simply defined X as all the trees of depth 1 and said that for a given data, show us the result where the fit is 0. And this works! And it saves a lot of computation work by sharing.</p>\n<p>Assume that @data simulates the equation <code>y = x * x</code>. Running our enumerator, we get:</p>\n<p><code>&quot;#Node{#Mul #Var{} #Var{}}&quot;</code></p>\n<p>Which is right!</p>\n<p>That&#39;s it for today, we understood how superposition works and event wrote a very simple (but cool) example on symbolic regression. I&#39;ll leave some links and references below:</p>\n<ul>\n<li><a href=\"https://en.wikipedia.org/wiki/Symbolic_regression\">Symbolic Regression</a></li>\n<li><a href=\"https://github.com/HigherOrderCO/HVM3\">HVM3</a></li>\n<li><a href=\"https://higherorderco.com/\">Higher Order CO</a></li>\n<li><a href=\"https://x.com/VictorTaelin\">Victor Taelin</a></li>\n<li><a href=\"https://gist.github.com/VictorTaelin/9061306220929f04e7e6980f23ade615\">SAT solver via superpositions</a></li>\n</ul>\n","title":"Symbolic Regression with Superposition on HVM3","description":"Understanding HVM superpositions","date":"2024-12-06"}},"__N_SSG":true}