{"pageProps":{"postData":{"id":"type-theory","contentHtml":"<p>A few months ago, I had contact with some really interesting open source projects. Compilers, languages, runtimes, mostly low level stuff I had little to no contact before. So I decided to dive in, and started studying. I ended up discovering a whole new world of theories, proofs and research.</p>\n<p>But I felt I did not know the basics, the fundamentals of it — mainly because when trying to read an article, I even had trouble understanding the notation.</p>\n<p>Have you ever seen something like this?</p>\n<p><img src=\"/images/type-theory/1.webp\" alt=\"typing rule\"></p>\n<p>It really seems complicated, but it is no monster. Let’s learn how to read this and what is type theory.</p>\n<hr>\n<h2>A little bit of history</h2>\n<p>We all know what a paradox is. Sometimes we hear some fun ones that make us think, such as the <a href=\"https://en.wikipedia.org/wiki/Twin_paradox\">Twin Paradox.</a> What happens is that physics and math are sources of many paradoxes. One of them is Russell’s paradox, which is a set-theoretic paradox that shows that every set theory that contains an unrestricted comprehension principle leads to contradictions. Basically, for any property, there is a set of all and only the objects that have that property. Then we have a set R that is the set of all sets that are not member of themselves. If R is not a member of itself, then its definition entails that it is a member of itself. Otherwise, if it is a member of itself, then it is not a member of itself since this is the set of all the sets that are not members of themselves.</p>\n<p>Well that is confusing, but read it slowly and understand the problem here.</p>\n<p>Type theory was created with the goal of avoiding paradoxes in a math equation based on set theory and formal logic. After that, we had progress on type theory such as ramified type theory together with an axiom of reducibility.</p>\n<p>We also have Alonzo Church into play with his Lambda Calculus — which is the most popular conjunction of type theory. Church demonstrated it as a foundation of mathematics — a higher-order logic.</p>\n<p>In modern literature, type theory usually refers to a typed system based on lambda calculus. Influential systems worth mentioning is Martin-Lofs intuitionistic type theory and Thierry Coquands calculus of constructions.</p>\n<hr>\n<h2>Introducing Type Theory</h2>\n<p>As the name states, in type theory, the basic object of study is a type. I am sure you are familiar with some types. For example, natural number is a type, usually denoted <code>nat</code> . Integer is also a type. <code>=</code> is a type called the identity type.</p>\n<p>Types can have terms (or terms can have types?). For example, 1 is a term of type <code>nat</code> , and we can declare it as <code>1 : nat</code> . This is a type declaration. This may sound familiar if you have experience with statically typed programming languages like Rust.</p>\n<p>We also have a special type called <code>Type</code> . As you may imagine, it is used to define the type of a type. So, for example, <code>nat : Type</code> is a valid declaration.</p>\n<p>Type theory is a subject that grows along with more fields, (such as category theory and proof theory) and we can have multiple interpretations for types. Here are some of them:</p>\n<ul>\n<li>A type is a set, and a term is an element of this set</li>\n<li>A type is a space, and a term is a point in this space</li>\n<li>A type is a proposition, and a term is a proof of this proposition</li>\n</ul>\n<p>Let’s introduce judgements, and a new symbol: <code>⊢</code></p>\n<p>How do we read the following judgement?</p>\n<p><code>⊢ A : Type</code></p>\n<p>We can read this as: A is of type Type. This is a simple judgement.</p>\n<p>Another symbol is used to represent Context: Γ (Gamma).</p>\n<p>Γ is a finite sequence of type declarations, aka context. Intuitively, this mean that the assumptions in the left-hand context imply the right-hand side.</p>\n<p><code>Γ ⊢ A : Type</code></p>\n<p>We read this as: Under context gamma, A is of type Type</p>\n<p>What about the following?</p>\n<p><code>Γ ⊢ A === B : Type</code></p>\n<p>This triple equal sign stands for judgemental equality. In type theory, we can have multiple types of equality, and note that this is different from the = sign stated as identity. So, Under context Gamma, A is judgementally equal to B which has type Type.</p>\n<hr>\n<h2>Function types</h2>\n<p>Most modern type theories introduce function types. They are introduced with an arrow symbol, and are defined inductively. For example, if <code>a</code> and <code>b</code> are types, then <code>a-&gt;b</code> is the type of a function which takes a parameter of type <code>a</code> and returns a term of type <code>b</code> . Types of this form are also known as simple types.</p>\n<p>Let’s walk through a simple example:</p>\n<pre><code>// add: a function that takes two natural numbers and return one nat number  \nadd : nat -&gt; (nat -&gt; nat)\n</code></pre>\n<p>You may find weird the parentheses, since we’re all used with something like <code>add(a : nat, b : nat) -&gt; : nat</code> . What happens is that, strictly speaking, a simple type only allows for one input and one output, and this way, we could not receive two args in the way I wrote. Therefore, a better way to read this is: <code>add</code> is a function which takes a <code>nat</code> and returns another function of the form <code>nat -&gt; nat</code> . Note that the arrow is right associative.</p>\n<p>Ok, but untill now Type theories seem pretty inofensive right? What can we do about it? What this has to do with the image in the beginning of the article?</p>\n<p>Well, the power of type theories is in specifying how terms may be combined through inference rules. For example, for functions we have function application. If <code>a</code> is a term of type <code>c -&gt; d</code> and <code>b</code> is a term of type <code>c</code> , then the application of <code>a</code> to <code>b</code> , often written <code>( a b)</code> has type <code>d</code> . Example:</p>\n<pre><code>3 : nat  \n6 : nat  \n10 : nat  \n  \n(add 3) : nat -&gt; nat // partial application 3 + x  \n((add 6) 3) : nat // 9  \n((add 10) ((add 3) 6)) : nat // results in (10 + (3 + 6)) = 19\n</code></pre>\n<p>Note that function application is left associative.</p>\n<hr>\n<h2>Computation</h2>\n<p>Type theory has a built-in notation of computation. The following terms are different:</p>\n<pre><code>1 + 5 : nat  \n3 + 3 : nat  \n0 + 6 : nat\n</code></pre>\n<p>But as you can see, they all compute to <code>6 : nat</code> . The concept of reduction / reduce to refer to computation. Example: <code>3 + 3 : nat</code> reduces to <code>6 : nat</code> and we can write this as: <code>3 + 3 : nat -&gt;&gt; 6 : nat</code> . A term without any variables that cannot be reduced further is called a canonical term.</p>\n<p>Terms that compute to the same term are equal. As I said before, equality is quite complex on type theory, and the equality we’re referring here is when two terms can be substituted for each other. For example:</p>\n<pre><code>x : nat  \nx + (10 + 2) : nat  \nx + (5 + 7) : nat  \n  \nx + (10 + 2) : nat -&gt;&gt; x + 12 : nat  \nx + (5 + 7) : nat -&gt;&gt; x + 12 : nat\n</code></pre>\n<p>The terms above are judgementally equal.</p>\n<p>OK, now that we discussed a little bit the basics, let’s try to develop a little bit more the function type (coming from lambda calculus). Let’s introduce it with a formal notation and then move forward to other types.</p>\n<hr>\n<h2>Function Types to Lambda Calculus : A formal formation</h2>\n<p>As discussed before, given two types A and B, there is a type <code>A -&gt; B</code>.</p>\n<p>We can write the formation rule for function types as follows:</p>\n<p><img src=\"/images/type-theory/2.webp\" alt=\"formation rule\"></p>\n<p>Remember that Γ stands for context. A formation rule, as its name states, gives us a way to form function types.</p>\n<p>We can read this rule as: Under context Gamma, if A is of type Type and B is of type Type, then we have a function from type A to type B.</p>\n<p>But besides that, we cannot do anything more yet. Here it comes the introduction rule:</p>\n<p><img src=\"/images/type-theory/3.webp\" alt=\"introduction rule\"></p>\n<p>We can read this as: Under context gamma, assume x is of type A. If b is of type B, then we have a function of type A that goes to type B receiving b as an argument.</p>\n<p>The introduction rule states that, to specify a term of <code>A -&gt; B</code>, it is sufficient to specify a term <code>b : B</code> for every <code>x : A</code> . To understand this rule, it is important to understand the lambda calculus representation of functions. So, for example: we can say that <code>λx.λy.( x y )</code> is a lambda term that receives two arguments, x and y, and applies x to y. When we receive an x and y, we substitute them in the term: <code>λx.λy ( x y ) negate 1 =&gt; ( negate 1 )</code>.</p>\n<p>That said, now we have terms of <code>A -&gt; B</code> but we have no rules to use them in a way. Now we need to introduce an <strong>elimination</strong> rule. The elimination rule for function type says that, given a function <code>f : A -&gt; B</code> and a term <code>a : A</code> we can form the term <code>f(a) : B</code> . Formally:</p>\n<p><img src=\"/images/type-theory/4.webp\" alt=\"elimination rule\"></p>\n<p>But well, we have no way to compute that. We do not know how to compute that. So, we have a computation rule that tells us what happens when the elimination rule is applied to a result of the introduction rule (in this case, a new function type).</p>\n<p><img src=\"/images/type-theory/5.webp\" alt=\"function type\"></p>\n<p>The notation <code>b[a / x] : B</code> is the term that we obtain from <code>b</code> by substituting <code>a</code> for every <code>x</code> . Therefore, we can read it as:</p>\n<p>Under context gamma, assume x is of type A. if b is of type B and a of type A, we have a function that receives b as an argument and it is judgementally equal to the term where we substitute all occurrences of x in b for a.</p>\n<p>To sum up, our rules state the following:</p>\n<ul>\n<li>For any type A and B, there is a type A -&gt; B called the function type. A term of A -&gt; B is called a function</li>\n<li>Defining a function <code>f : A -&gt; B</code> is equivalent to defining a term <code>f(x) : B</code> for every <code>x : A</code> .</li>\n</ul>\n<p>And, as I said before, type theory has many interpretations. About functions we can say that:</p>\n<ul>\n<li>For sets, it is the set of functions from set A to set B.</li>\n<li>For spaces, it is a space of function from A to B</li>\n<li>For propositions, this represents A implies B since having a proof o A -&gt; B is equivalent to having a proof of B for every proof of A.</li>\n</ul>\n<p>In the next article of this type theory series, we will discuss more this rules and introduce new types. If you find any mistake or typo, feel free to comment, as I’m still pretty new to this subject as well. Thanks for reading!</p>\n<hr>\n<h2>References</h2>\n<p><a href=\"https://en.wikipedia.org/wiki/Type_theory?source=post_page-----437df9e418c5--------------------------------\">Type theory - Wikipedia</a></p>\n<p><a href=\"https://plato.stanford.edu/entries/type-theory/?source=post_page-----437df9e418c5--------------------------------\">Type Theory</a></p>\n<p><a href=\"https://ncatlab.org/nlab/show/type+theory?source=post_page-----437df9e418c5--------------------------------\">nLab type theory</a></p>\n<p><a href=\"https://en.wikipedia.org/wiki/History_of_type_theory?source=post_page-----437df9e418c5--------------------------------\">History of type theory - Wikipedia</a></p>\n<p>And papers in the reference of those :)</p>\n","title":"Type Theory 101","description":"Basics of TT","date":"2024-05-21"}},"__N_SSG":true}